; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph0 - mode
	thermograph3 - mode
	thermograph6 - mode
	image1 - mode
	spectrograph4 - mode
	infrared7 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph6)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph5)
	(supports instrument0 infrared7)
	(supports instrument0 image1)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(have_image Phenomenon5 image1)
	(have_image Planet6 infrared7)
	(have_image Planet6 thermograph3)
	(have_image Star7 spectrograph5)
	(have_image Star8 infrared7)
	(have_image Star9 thermograph6)
	(have_image Star9 spectrograph2)
	(have_image Star10 spectrograph0)
	(have_image Star10 spectrograph5)
	(have_image Star11 thermograph6)
	(have_image Star11 spectrograph5)
	(have_image Phenomenon12 thermograph6)
	(have_image Phenomenon12 spectrograph4)
))

)

; plan
1. (turn_to satellite0 groundstation3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 0 of 13
5. (take_image satellite0 star8 instrument0 infrared7)
   added: (have_image star8 infrared7)
   goals met: 1 of 13
6. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 1 of 13
7. (take_image satellite0 star7 instrument0 spectrograph5)
   added: (have_image star7 spectrograph5)
   goals met: 2 of 13
8. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 2 of 13
9. (take_image satellite0 planet6 instrument0 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 3 of 13
10. (take_image satellite0 planet6 instrument0 infrared7)
   added: (have_image planet6 infrared7)
   goals met: 4 of 13
11. (turn_to satellite0 phenomenon5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 13
12. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 5 of 13
13. (turn_to satellite0 phenomenon12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 13
14. (take_image satellite0 phenomenon12 instrument0 thermograph6)
   added: (have_image phenomenon12 thermograph6)
   goals met: 6 of 13
15. (take_image satellite0 phenomenon12 instrument0 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 7 of 13
16. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 7 of 13
17. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 8 of 13
18. (take_image satellite0 star10 instrument0 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 9 of 13
19. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 9 of 13
20. (take_image satellite0 star11 instrument0 spectrograph5)
   added: (have_image star11 spectrograph5)
   goals met: 10 of 13
21. (take_image satellite0 star11 instrument0 thermograph6)
   added: (have_image star11 thermograph6)
   goals met: 11 of 13
22. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 11 of 13
23. (take_image satellite0 star9 instrument0 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 12 of 13
24. (take_image satellite0 star9 instrument0 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 13 of 13
